export default class HeadphonesStoreService {
    data = [
        {
            id: 1,
            img: 'apple_byz_s8521.png',
            title: 'Apple BYZ S8521',
            oldprice: 3527,
            discount: '',
            price: 2927,
            rate: 4.7,
            type: 'wired',
            specification: {
                country: 'Вьетнам',
                ear_pads_material: 'Пластик',
                sensitivity: '109 дБ',
                guarantee: '1 год',
                service_life: '3 года',
                frequency_range: '20 Гц - 22 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 2,
            img: 'apple_earpods.png',
            title: 'Apple EarPods',
            oldprice: '',
            discount: '',
            price: 2327,
            rate: 4.5,
            type: 'wired',
            specification: {
                country: 'Вьетнам',
                ear_pads_material: 'Пластик',
                sensitivity: '109 дБ',
                guarantee: '1 год',
                service_life: '1 года',
                frequency_range: '20 Гц - 20 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 3,
            img: 'JVC-Wood-Black.png',
            title: 'JVC Wood Black',
            oldprice: '',
            discount: 10,
            price: 15999,
            rate: 4.5,
            type: 'wired',
            specification: {
                country: 'Китай',
                ear_pads_material: 'Силикон',
                sensitivity: '96 дБ',
                guarantee: '1 год',
                service_life: '2 года',
                frequency_range: '20 Гц - 22 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 4,
            img: 'Bang-&-Olufsen-BeoPlay-H3.png',
            title: 'Bang & Olufsen BeoPlay H3',
            oldprice: 10999,
            discount: '',
            price: 9399,
            rate: 4.7,
            type: 'wired',
            specification: {
                country: 'Китай',
                ear_pads_material: 'Силикон',
                sensitivity: '100 дБ',
                guarantee: '2 год',
                service_life: '2 года',
                frequency_range: '20 Гц - 16 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 5,
            img: 'Razer-Hammerhead-Duo.png',
            title: 'Razer Hammerhead Duo',
            oldprice: '',
            discount: '',
            price: 6999,
            rate: 4.7,
            type: 'wired',
            specification: {
                country: 'Китай',
                ear_pads_material: 'Силикон',
                sensitivity: '112 дБ',
                guarantee: '2 год',
                service_life: '2 года',
                frequency_range: '20 Гц - 20 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 6,
            img: 'Samsung-HS130-Blue.png',
            title: 'Samsung HS130',
            oldprice: '',
            discount: '15',
            price: 5999,
            rate: 4.3,
            type: 'wired',
            specification: {
                country: 'Вьетнам',
                ear_pads_material: 'Силикон',
                sensitivity: '102 дБ',
                guarantee: '1 год',
                service_life: '1 года',
                frequency_range: '20 Гц - 22 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 7,
            img: 'apple_airpods.png',
            title: 'Apple AirPods',
            oldprice: '',
            discount: '',
            price: 9527,
            rate: 4.7,
            type: 'wireless',
            specification: {
                country: 'Китай',
                ear_pads_material: 'Пластик',
                sensitivity: '112 дБ',
                guarantee: '1 год',
                service_life: '1 года',
                frequency_range: '20 Гц - 22 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 8,
            img: 'gerlax_gh-04.png',
            title: 'GERLAX GH-04',
            oldprice: '',
            discount: '',
            price: 6527,
            rate: 4.7,
            type: 'wireless',
            specification: {
                country: 'Китай',
                ear_pads_material: 'Силикон',
                sensitivity: '109 дБ',
                guarantee: '6 месяцев',
                service_life: '1 года',
                frequency_range: '20 Гц - 20 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 9,
            img: 'borofone_bo4.png',
            title: 'BOROFONE BO4',
            oldprice: '',
            discount: '',
            price: 7527,
            rate: 4.7,
            type: 'wireless',
            specification: {
                country: 'Китай',
                ear_pads_material: 'Кожа',
                sensitivity: '96 дБ',
                guarantee: '1 год',
                service_life: '2 года',
                frequency_range: '20 Гц - 22 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
        {
            id: 10,
            img: 'samsung-galaxy-buds.png',
            title: 'Samsung Galaxy Buds2',
            oldprice: 6999,
            discount: '',
            price: 5599,
            rate: 4.8,
            type: 'wireless',
            specification: {
                country: 'Китай',
                ear_pads_material: 'Силикон',
                sensitivity: '96 дБ',
                guarantee: '1 год',
                service_life: '2 года',
                frequency_range: '20 Гц - 22 кГц',
            },
            about_product: `Внутриканальные наушники JVC Wood – это миниатюрность, удобство, качественный звук, обеспечиваемый современными технологиями, и необычный дизайн. Купола диафрагм диаметром 11 мм и внешние корпуса выполнены из натурального дерева, что способствует более точному воспроизведению и особенно актуально для High-Res-аудио.
            ОСНОВНЫЕ СПЕЦИФИКАЦИИ
            Специальный деревянный стабилизатор и четырёхгранный металлический гармонизатор нейтрализуют вибрацию, обеспечивая чистоту звука. Частотный диапазон от 6 до 50 000 Гц, чувствительность составляет 104 дБ – вы сможете насладиться всем богатством и широтой акустической палитры, включая корректно детализированные средние частоты и мощные, бархатистые, действительно ощутимые басы.
            УНИВЕРСАЛЬНОЕ РЕШЕНИЕ
            Съёмный кабель длиной 1,2 м удобен и для уличного, и для домашнего использования. Он заключён в прочную оплётку, надёжно защищающую его от перекручивания и переламывания. В комплекте – силиконовые вставки пяти размеров, так что подобрать подходящий вариант не составит труда. Кроме того, для хранения и транспортировки наушников прилагается кейс, а для аккуратного скручивания шнура – держатель и зажим.`,
        },
    ];

    getHeadphones = async (headphoneid) => {
        if (headphoneid === undefined) {
            return this.data;
        }
        const HeadphonesList = this.data.filter((d) => d.id == headphoneid);
        return HeadphonesList;
    };
}
